404Zen/STM32H7_Arm2D/Code/app/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TOUCH_RESET_Pin GPIO_PIN_3
#define TOUCH_RESET_GPIO_Port GPIOE
#define TOUCH_INT_Pin GPIO_PIN_4
#define TOUCH_INT_GPIO_Port GPIOE
#define TOUCH_SCL_Pin GPIO_PIN_5
#define TOUCH_SCL_GPIO_Port GPIOE
#define TOUCH_SDA_Pin GPIO_PIN_6
#define TOUCH_SDA_GPIO_Port GPIOE
#define KEY0_Pin GPIO_PIN_13
#define KEY0_GPIO_Port GPIOC
#define LED0_Pin GPIO_PIN_1
#define LED0_GPIO_Port GPIOC
#define TEST_SDA_Pin GPIO_PIN_7
#define TEST_SDA_GPIO_Port GPIOE
#define TEST_SCL_Pin GPIO_PIN_13
#define TEST_SCL_GPIO_Port GPIOB
#define LCD_BL_Pin GPIO_PIN_15
#define LCD_BL_GPIO_Port GPIOD
#define TEST_IO_Pin GPIO_PIN_12
#define TEST_IO_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */
uint32_t user_systick_reload_get(void);
uint32_t user_systick_value_get(void);
uint32_t user_get_system_core_clk(void);
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
